Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/D10B.tmx
Source language: en_us
Languages: zh_cn

source: Who Created God?
zh_cn: 谁创造了上帝？

source: Where Did God Come From?
zh_cn: 上帝从哪儿来？

source: A common argument from atheists and skeptics is that if all things need a cause, then God must also need a cause.
zh_cn: 无神论者和怀疑论者比较常见的争论是是否所有事情都需要一个原因，这样的话上帝的存在也就需要一个因。

source: The conclusion is that if God needed a cause, then God is not God (and if God is not God, then of course there is no God).
zh_cn: 结论是如果上帝的存在需要一个原因的话，上帝就不是上帝了（如果上帝不是上帝了，很显然这个世界上就不存在上帝了）。

source: This is a slightly more sophisticated form of the basic question "Who made God?"
zh_cn: 同样的问题有个比较高明的问法，那就是“谁创造了上帝？”。

source: Everyone knows that something does not come from nothing.
zh_cn: 每个人都知道事物的存在是有其由来的。

source: So, if God is a "something," then He must have a cause, right?
zh_cn: 所以说，如果上帝是意义重大的，那么他的存在肯定也是有原因的，对吗？

source: The question is tricky because it sneaks in the false assumption that God came from somewhere and then asks where that might be.
zh_cn: 这个问题是很微妙的，因为它通过“上帝从某处来”巧妙地规避了答案，但是人们又会问，“那个某处到底是哪里呢？”

source: The answer is that the question does not even make sense.
zh_cn: 答案是这个问题根本就没有意义。

source: It is like asking, "What does blue smell like?"
zh_cn: 这就像在问“蓝色闻起来是什么味道呢？”

source: Blue is not in the category of things that have a smell, so the question itself is flawed.
zh_cn: 蓝色不属于有味道的物种，所以这个问题本身就是错误的。

source: In the same way, God is not in the category of things that are created or caused.
zh_cn: 同样的，上帝根本就不在创造的和人为的讨论范畴之内。

source: God is uncaused and uncreated--He simply exists.
zh_cn: 上帝既不是人为的也不是被创造的——他就在那儿。

source: How do we know this?
zh_cn: 然而我们又是怎么知道的呢？

source: We know that from nothing, nothing comes.
zh_cn: 我们从一片虚无中知道的，那个时候什么都不存在。

source: So, if there were ever a time when there was absolutely nothing in existence, then nothing would have ever come into existence.
zh_cn: 所以，如果有一段时间完全不存在任何东西，那么就什么也没有出现过。

source: But things do exist.
zh_cn: 但是这些物质确实存在。

source: Therefore, since there could never have been absolutely nothing, something had to have always been in existence.
zh_cn: 因此，既然每段时间都存在着一些事物，那么这些既定事物就是存在着。

source: That ever-existing thing is what we call God.
zh_cn: 那些曾经存在的事物就是我们所谓的上帝。

source: God is the uncaused Being that caused everything else to come into existence.
zh_cn: 上帝本身就是存在的。这样的存在导致其他事物陆续出现。

source: God is the uncreated Creator who created the universe and everything in it.
zh_cn: 上帝是自存的创造者，他创造了宇宙以及其中的天地万物。
